Development/taxiexpress/app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT `drivers`.* FROM `drivers`