Development/taxiexpress/app/controllers/feedbacks_controller.rb

SELECT `feedbacks`.* FROM `feedbacks`
---
  def index
    @feedbacks = Feedback.all

INSERT INTO `feedbacks` (`description`, `reservation_id`, `created_at`, `updated_at`) VALUES ('Buen servicio sigan asi', 1, '2015-10-10 05:28:00', '2015-10-10 05:28:00')
---
  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save

SELECT  `feedbacks`.* FROM `feedbacks` WHERE `feedbacks`.`id` = 1 LIMIT 1
---
    def set_feedback
      @feedback = Feedback.find(params[:id])