Development/taxiexpress/app/controllers/operators_controller.rb

SELECT `operators`.* FROM `operators`
---
  def index
    @operators = Operator.all