Development/taxiexpress/app/controllers/paymenttypes_controller.rb

  def index
    @paymenttypes = Paymenttype.all
---
SELECT `paymenttypes`.* FROM `paymenttypes`