Development/taxiexpress/app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT `reservations`.* FROM `reservations`  ORDER BY id desc

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO `reservations` (`passengersquantity`, `vehicletype`, `beginningadress`, `destinationadress`, `price`, `user_id`, `status_id`, `created_at`, `updated_at`) VALUES (3, 'custer', 'av dominicos', 'av san borja', 15, 2, 1, '2015-10-10 05:11:52', '2015-10-10 05:11:52')

  def update
    respond_to do |format|
      if @reservation.update(reservation_params)
---
UPDATE `reservations` SET `reservationdate` = '2015-10-10 07:09:00', `updated_at` = '2015-10-10 07:09:19' WHERE `reservations`.`id` = 4

    def set_reservation
      @reservation = Reservation.find(params[:id])
---
SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`id` IN (NULL, NULL)