Development/taxiexpress/app/controllers/reservations_controller.rb

SELECT  `reservations`.* FROM `reservations`  ORDER BY id desc LIMIT 3
---
  def index
    if current_user
      if current_user.user?
        @reservations = Reservation.all.order("id desc").limit(10)
      else
        @reservations = Reservation.all.order("id desc")