Development/taxiespress/app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`
---
  def index
    @contacts = Contact.all