Development/taxiespress/app/controllers/vehicles_controller.rb

SELECT `vehicles`.* FROM `vehicles`
---
  def index
    @vehicles = Vehicle.all

INSERT INTO `vehicles` (`name`, `trademark`, `model`, `year`, `driver_id`, `created_at`, `updated_at`) VALUES ('XT25', 'CHEVROLET', 'GH-FGDF', 2006, 1, '2015-09-17 00:30:07', '2015-09-17 00:30:07')
---
  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save

SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = 1 LIMIT 1
---
    def set_vehicle
      @vehicle = Vehicle.find(params[:id])